{
"intents": [
{
"tag": "Bonjour",
      "patterns": [
        "Bonjour",
        "Salut, comment ça va?",
        "j'espère que vous allez bien",
        "salut",
        "Salut",
        "comment allez vous",
        "bonsoir",
        "Bonsoir",
        "cv?",
        "Cv?",
        "est il possible de discuter avec quelqu'\\un ?",
        "Hello",
        "Test"
      ],
      "responses": [
        "Bonjour ! Comment puis-je vous aider?",
        "Bienvenue ! En quoi puis-je vous aider?"
      ],
      "context": [""]},
{
 "tag": "Au revoir",
      "patterns": [
        "Au revoir",
        "À plus tard",
        "Bye",
        "d'\\accord",
        "ok",
        "bonne journée",
        "Bonne journnée",
        "bonne fin de journée ",
        "bonne journée à vous",
        "bonne fin de journée à vous",
        "c'\\est bon",
        "A+",
        "ok merci"
      ],
      "responses": [
        "Au revoir ! Bonne journée.",
        "À bientôt. N'hésitez pas à revenir si vous avez d'autres questions."
      ],
      "context": [""]
},
{
"tag": "Merci",
"patterns": [ "merci", "Merci", "merci pour votre aide", "merci pour votre assistance", "Merci pour votre aide", "Merci pour votre assistance", "Merci de n'\\avoir consacré votre temps", "merci infiniment" ],
"responses": [ "avec plaisir", "avec plaisir, bon chance.", "je vous en pris", "Pas de problème. Faites-moi savoir si vous avez besoin de plus d'aide." ],
"context": [ "" ]
},
{
"tag": "Info sur l'école",
"patterns": [ "Quels sont les horaires de l'école?", "Quand commence l'école?", "Quelle est l'adresse de l'école?", "Quel est le numéro de téléphone de l'école?" ],
"responses": [ "Les horaires de l'école sont de 8h00 à 15h00. L'école est située au 123 rue principale. Le numéro de téléphone est le (123) 456-7890." ],
"context": [ "" ]
},
{
"tag": "Info sur l'orientation",
"patterns": [ "Quand est l'orientation?", "Que se passe-t-il pendant l'orientation?", "Dois-je assister à l'orientation?" ],
"responses": [ "L'orientation est le 30 août à 9h00. Pendant l'orientation, vous recevrez des informations importantes sur l'école et rencontrerez vos professeurs. La participation est fortement recommandée." ],
"context": [ "" ]
},
{
"tag": "Info sur l'inscription",
"patterns": [ "Comment m'inscrire à l'école?", "Quels documents dois-je apporter pour l'inscription?", "Y a-t-il une date limite d'inscription?" ],
"responses": [ "Vous pouvez vous inscrire à l'école en visitant le bureau principal et en remplissant le formulaire d'inscription. Vous devrez apporter une copie de votre acte de naissance, une preuve d'adresse et un carnet de vaccination. La date limite d'inscription est le 15 août." ],
"context": [ "" ]
},
{
    "tag": "bourse",
    "patterns": [ "Je vous contacte concernant le problème de traitement en cours des étudiants boursiers en lp Il y'a un formulaire à remplir sur votre site mais quand je viens de le remplir il y'a un problème"],
    "responses":["Veillez contacter le service de bourse de service de scolarité de la FSJES Tétouan", "veuillez contacter le service chargé des bourse au niveau de la scolarité de la faculté", "veuillez c "]
},
{
    "tag": "reconaissance",
    "patterns": [ "comment voir si une école est reconnue ou pas ?", "est-ce que mon école est reconnue ?"],
    "responses":["voir le bulletin officiel est chercher l'intitulé de l'école."],
    "context":[ ""]
},
{
    "tag": "Emploi du temps",
    "patterns": ["Quel est l'emploi du temps de la semaine?", "Où puis-je trouver l'emploi du temps?", "Quels sont les cours prévus aujourd'hui?"],
    "responses": ["L'emploi du temps de la semaine est disponible sur le site de l'école. Vous pouvez le consulter en ligne.", "L'emploi du temps est affiché sur le panneau d'affichage près du secrétariat de l'école.", "L'emploi du temps est distribué en début de chaque semaine aux étudiants."],
    "context": [""]
    },
    {
    "tag": "Programmes d'études",
    "patterns": ["Quels sont les programmes d'études disponibles?", "Quels sont les cours proposés par l'école?", "Quel est le programme de la filière X?"],
    "responses": ["L'école propose une variété de programmes d'études, notamment en sciences, en arts et en langues. Vous pouvez obtenir des informations détaillées sur les programmes sur le site de l'école.", "Les cours proposés par l'école couvrent un large éventail de domaines, tels que les mathématiques, la littérature, les sciences sociales et bien d'autres.", "Le programme de la filière X comprend des cours spécifiques liés à ce domaine, tels que A, B et C."],
    "context": [""]
    },
    {
        "tag": "Services de soutien",
        "patterns": ["Quels services de soutien sont disponibles pour les étudiants?", "Où puis-je obtenir de l'aide pour mes études?", "Y a-t-il un service d'orientation professionnelle?"],
        "responses": ["L'école offre différents services de soutien aux étudiants, tels que des services de tutorat, des conseils scolaires et des services d'orientation professionnelle. Vous pouvez vous rendre au bureau des services aux étudiants pour obtenir de l'aide.", "Pour obtenir de l'aide supplémentaire pour vos études, vous pouvez contacter le service de tutorat de l'école. Ils seront heureux de vous assister.", "Oui, l'école propose un service d'orientation professionnelle pour vous aider à explorer vos options de carrière et prendre des décisions éclairées."],
        "context": [""]
        },
        {
        "tag": "Vacances scolaires",
        "patterns": ["Quelles sont les dates des vacances scolaires?", "Quand commence et se termine la période des vacances?", "Combien de temps durent les vacances scolaires?"],
        "responses": ["Les dates des vacances scolaires varient chaque année. Vous pouvez consulter le calendrier scolaire officiel pour connaître les dates précises.", "La période des vacances commence généralement à la fin de l'année scolaire et se termine avant la rentrée suivante. La durée des vacances peut varier.", "Les vacances scolaires sont généralement d'une durée de quelques semaines. Les dates exactes sont disponibles dans le calendrier scolaire de l'école."],
        "context": [""]
        },
        {
        "tag": "SupMTI",
        "patterns": ["SupMTI", "informations sur l'école supmti", "école d'informatique", "école de management", "école privé", "école accréditée", "école privé étatique"],
        "responses": ["SUP MTI - École Supérieure de Management, Télécommunications et d'Informatique à Rabat au Maroc est un établissement d’enseignement supérieur privé reconnu par l'État, créé en 2006 par un groupe d’enseignants de l'École nationale supérieure d'informatique et d'analyse des systèmes (ENSIAS), pour satisfaire les besoins du secteur professionnel en cadres de haut niveau dans les domaines du génie logiciel, des réseaux ainsi que celui du management. pour plus d'infos voir leur site : https://supmti.ac.ma/"],
        "context":[""]
        }

]
}